tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "drone/drone"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "osx-cross/avr"
tap "thoughtbot/formulae"
cask "java"
cask "xquartz"
brew "autoconf"
brew "automake"
brew "libelf"
brew "libusb"
brew "libusb-compat"
brew "libftdi0"
brew "avrdude"
brew "c-ares"
brew "fontconfig"
brew "gettext"
brew "pixman"
brew "gmp"
brew "mpfr"
brew "chromedriver"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "dbus"
brew "dfu-programmer"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "exercism"
brew "fasd"
brew "fortune"
brew "freexl"
brew "perl"
brew "git"
brew "jpeg"
brew "json-c"
brew "lzlib"
brew "readline"
brew "openssl"
brew "python3"
brew "geckodriver"
brew "geoip"
brew "global", args: ["with-ctags", "with-pygments"]
brew "nettle"
brew "pinentry"
brew "gnupg"
brew "gpg-agent"
brew "haskell-stack"
brew "heroku"
brew "htop"
brew "hub"
brew "libtool"
brew "imagemagick"
brew "ispell"
brew "jemalloc"
brew "libmpc"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxslt"
brew "libyaml"
brew "libzip"
brew "lolcat"
brew "mas"
brew "memcached", restart_service: true
brew "msgpack"
brew "unibilium"
brew "neovim"
brew "nmap"
brew "nvm"
brew "phantomjs"
brew "postgresql", restart_service: true
brew "postgis"
brew "postgresql@9.5"
brew "pstree"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "rbenv-ctags"
brew "rbenv-vars"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rename"
brew "ruby"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmuxinator-completion"
brew "tree"
brew "unixodbc"
brew "vim"
brew "watchman"
brew "wget"
brew "wireshark", args: ["with-qt"]
brew "wxmac"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc"
brew "osx-cross/avr/avr-libc"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "alfred"
cask "bartender"
cask "bdash"
cask "bettertouchtool"
cask "blisk"
cask "caffeine"
cask "dash"
cask "dropbox"
cask "firefox"
cask "flux"
cask "gitter"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "handbrakecli"
cask "hyper"
cask "inkscape"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "licecap"
cask "little-snitch"
cask "micro-snitch"
cask "mono-mdk"
cask "paw"
cask "postman"
cask "sketch"
cask "skyfonts"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "wireshark-chmodbpf"
mas "DaisyDisk", id: 411643860
mas "Icon Slate", id: 439697913
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "OmniFocus", id: 867299399
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
