tap "d12frosted/emacs-plus"
tap "drone/drone"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "osx-cross/avr"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "vitorgalvao/tiny-scripts"
tap "wix/brew"
cask "java"
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# ELF object file access library
brew "libelf"
# Library for USB device access
brew "libusb-compat"
# Library to talk to FTDI chips
brew "libftdi0"
# Atmel AVR MCU programmer
brew "avrdude"
# SSL/TLS cryptography library
brew "openssl"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Low-level library for pixel manipulation
brew "pixman"
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for multiple-precision floating-point computations
brew "mpfr"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Message bus system, providing inter-application communication
brew "dbus"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr", link: true
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# CLI tool for quick access to files and directories
brew "fasd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Library to extract data from Excel .xls files
brew "freexl"
# JSON parser for C
brew "json-c"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Source code tag system
brew "global", args: ["with-ctags", "with-pygments"]
# Low-level cryptographic library
brew "nettle"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GPG key agent
brew "gpg-agent", link: true
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# The Haskell Tool Stack
brew "haskell-stack"
# Command-line client for the cloud PaaS
brew "heroku"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Cross-platform library for communicating with iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in many formats
brew "imagemagick", args: ["with-libheif"]
# International Ispell
brew "ispell"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Data compression library
brew "lzlib"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Object-relational database system
brew "postgresql", link: false
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Object-relational database system
brew "postgresql@9.5", link: true
# Show ps output as a tree
brew "pstree"
# Cross-platform application and UI framework
brew "qt"
# Automatically generate ctags for rbenv Ruby stdlibs
brew "rbenv-ctags"
# Safely sets global and per-project environment variables
brew "rbenv-vars"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus"
# This is a Sentry command-line client for some generic tasks.
brew "getsentry/tools/sentry-cli"
# GNU Binutils for the AVR target
brew "osx-cross/avr/avr-binutils"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc"
brew "thoughtbot/formulae/parity"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Script to quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Apple simulator utilities
brew "wix/brew/applesimutils"
cask "1password"
cask "alfred"
cask "anaconda"
cask "android-ndk"
cask "android-studio"
cask "bartender"
cask "bdash"
cask "bettertouchtool"
cask "blisk"
cask "charles"
cask "chromedriver"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "fastlane"
cask "firebase-admin"
cask "firefox"
cask "flux"
cask "gitter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "graphiql"
cask "graphql-ide"
cask "graphql-playground"
cask "handbrake"
cask "hyper"
cask "inkscape"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "java8"
cask "karabiner"
cask "karabiner-elements"
cask "keycastr"
cask "licecap"
cask "mono-mdk"
cask "ngrok"
cask "numi"
cask "oni"
cask "paw"
cask "postman"
cask "pusher"
cask "razer-synapse"
cask "react-native-debugger"
cask "reactotron"
cask "sketch"
cask "skyfonts"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "webarchiveplayer"
cask "wireshark"
cask "zeplin"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "GIPHY CAPTURE", id: 668208984
mas "Icon Slate", id: 439697913
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "OmniFocus", id: 867299399
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
